Revit 2027 API
BuiltInFailures.CutterFailures Class
 Failures about Cutter.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BuiltInFailures.CutterFailures
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static class CutterFailures
Public NotInheritable Class CutterFailures
public ref class CutterFailures abstract sealed
[<AbstractClassAttribute>]
[<SealedAttribute>]
type CutterFailures = class end
The BuiltInFailures.CutterFailures type exposes the following members.
Properties
Name | Description
MakeCutterForPlanRegionsGStepFailed |  Failed to make cutter for plan view with plan regions. Try deleting one or more plan regions.
MakeCutterForSectionGStepFailed |  Attempt to create or manipulate a segmented section has failed.
Top
See Also
Reference
Autodesk.Revit.DB Namespace